html/Misc/personal-websites-are-dumb/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Personal Websties Are Dumb</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
</head>
<body>
<div id="preamble" class="status">
<header>
      <span id="name-link"></span>
        <nav>
	  <ul>
	    <li><a href="mailto:email@ianstranathan.com"><i class="fa fa-envelope" aria-hidden="true"></i></a></li>
	    <li><a href="https://github.com/ianstranathan"><i class="fa-brands fa-github"></i></a></li>
	  </ul>
	</nav>
    </header>
</div>
<div id="content" class="content">
<h1 class="title">Personal Websties Are Dumb</h1>
<p>
See <a href="https://www.vlambeer.com/">Vlambeer's</a> or <a href="http://number-none.com/blow/blog/">Jonathan Blow's Website</a> extended commentary can be found <a href="https://motherfuckingwebsite.com/">here</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=tHEOGrkhDp0">Advertizing is almost always bad</a> (At a minimum it's unproductive/ unsubstantive/ empty.).
Most of the time personal websites are just personal advertising. 
</p>

<p>
Jon Blow is a proven, top-shelf programmer and designer, who cares what his website looks like?
</p>

<p>
But we all can't be Jon Blow. Enter the personal portfolio (a website being part of that).
</p>

<p>
In line with skill and credentialing inflation, a well developed (I should say superficially pleasing) portfolio is (counterproductively) required for a job nowadays.
(But wait, wasn't that what college was for? Why did I study so hard and stress out so much if that doesn't count as a general vetting process of baseline competence?
 <i>Gute frage nächste frage.</i>)
</p>

<p>
It's an absurd, boring-dystopia moment when you're being interviewed for a technical skill by someone who doesn't have said technical skill and
they're judging you primarily and negatively for the plainness of your portfolio website.
(This is disappointing for both parties, while Jon Blow is anecdotal, I do geuinely think website excessiveness is in fact usually inversly related with ability
(with some notable exceptions like <a href="http://acko.net">Steven Witten</a>), I assume they want the best engineer possible and I want to waste as little time as possible)
</p>

<p>
I could try to make a fanicer website (<a href="https://zackmibrown.github.io/">here's one</a> I started for a friend: spinnable-business card) but it's ultimately dissipative for non-renewable resources like time and
ability which we're all rapidly running out of.
</p>

<p>
<b>Wouldn't we all rather be writing stories, making games or solving interesting &amp; real problems instead?</b>
</p>

<p>
Moreover, isn't it, as said above, <span class="underline">counterproductive to a real portfolio</span> to spend said resources on something that ultimately has nothing to do with the skills and
knowledge you're trying to hone?
</p>

<p>
I tend to remake my website about once a year (revist resume, tidy up etc.) and this year is no different.
(Emacs has become my editor of choice and so another website iteration using org mode seemed relevant),
but I'm done doing anything beyond content (anything superfluous that I don't find interesting or care about).
</p>

<p>
Minimal styling that I can hack ontop of and a small, personal SSG from here on out until societal collapse and I don't have to interact with computers anymore.
(I still want slightly more control and customizable workflow than a standard SSG framework (hugo, jekyll etc) allows otherwise I'd just do that. They can also be
complicated to maintain and usually have a lot of dependencies that break over time)
</p>

<p>
Maintenance is a contraint with a concomitant cost and I'm not willing to pay more than its minimum for a personal website.
</p>

<p>
If there's a silver lining, maybe this is a lesson that's transferable to other things that have incurred a heavy maintenance cost;
accepting and hacking ontop of rather than reinventing the various technical black boxes that inevitably come.
</p>

<p>
Maybe this is finally how I learn to <b>stop worrying and love not reinventing the wheel.</b>    
</p>
</div>
<div id="postamble" class="status">
<footer>
    <p>All content on this site is © Ian Stranathan,
      <span id="current-year"></span>.
      <br>Use of this content for training AI or machine learning models is <em>not allowed</em>.
    </p>
  </footer>
<script>document.addEventListener('DOMContentLoaded', function() {
    const yearSpan     = document.getElementById('current-year');
    const h1_name_link = document.getElementById('name-link');
    if (yearSpan)
    {
      yearSpan.textContent = new Date().getFullYear();
    }
    if (h1_name_link)
    {
      // if the page is the main page, h1, else link to main page
      h1_name_link.innerHTML = window.location.href === "https://www.ianstranathan.com/" ? "<h1>Ian Stranathan</h1>" : '<h1><a href="https://www.ianstranathan.com/">Ian Stranathan</a></h1>'
    }
  });
</script>
</div>
</body>
</html>
